TabVAEModel(
  (cat_embeds): ModuleList(
    (0-1): 2 x Embedding(7, 16)
    (2): Embedding(2, 16)
    (3): Embedding(24, 16)
    (4): Embedding(2, 16)
    (5): Embedding(4, 16)
    (6): Embedding(2, 16)
    (7): Embedding(1, 16)
    (8-18): 11 x Embedding(2, 16)
    (19): Embedding(1, 16)
    (20-25): 6 x Embedding(2, 16)
    (26): Embedding(13, 16)
    (27): Embedding(3, 16)
    (28): Embedding(4, 16)
    (29): Embedding(5, 16)
    (30): Embedding(7, 16)
    (31-34): 4 x Embedding(2, 16)
    (35-37): 3 x Embedding(1, 16)
    (38-39): 2 x Embedding(2, 16)
  )
  (transformer): TabTransformerBlock(
    (transformer): TransformerEncoder(
      (layers): ModuleList(
        (0-1): 2 x TransformerEncoderLayer(
          (self_attn): MultiheadAttention(
            (out_proj): NonDynamicallyQuantizableLinear(in_features=16, out_features=16, bias=True)
          )
          (linear1): Linear(in_features=16, out_features=2048, bias=True)
          (dropout): Dropout(p=0.1, inplace=False)
          (linear2): Linear(in_features=2048, out_features=16, bias=True)
          (norm1): LayerNorm((16,), eps=1e-05, elementwise_affine=True)
          (norm2): LayerNorm((16,), eps=1e-05, elementwise_affine=True)
          (dropout1): Dropout(p=0.1, inplace=False)
          (dropout2): Dropout(p=0.1, inplace=False)
        )
      )
    )
  )
  (encoder): VAEEncoder(
    (mlp): Sequential(
      (0): Linear(in_features=669, out_features=128, bias=True)
      (1): ReLU()
      (2): Linear(in_features=128, out_features=128, bias=True)
      (3): ReLU()
    )
    (fc_mu): Linear(in_features=128, out_features=32, bias=True)
    (fc_logvar): Linear(in_features=128, out_features=32, bias=True)
  )
  (decoder): VAEDecoder(
    (model): Sequential(
      (0): Linear(in_features=32, out_features=128, bias=True)
      (1): ReLU()
      (2): Linear(in_features=128, out_features=669, bias=True)
    )
  )
  (classifier): VAEClassifier(
    (model): Sequential(
      (0): Linear(in_features=32, out_features=64, bias=True)
      (1): ReLU()
      (2): Linear(in_features=64, out_features=1, bias=True)
      (3): Sigmoid()
    )
  )
)